cases/Biofilm_growth/multi_pores/c/cyclic-c-8e-5/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss LUST grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(rhoPhiByEps,U)  Gauss linear;
    div(HbyA)           Gauss linear;
    div(rhofHbyA)       Gauss linear;
    div(volIntegrate(rhofPhi))   Gauss linear;
    div(phi,Wf)       Gauss linear;
    div(volIntegrate(phi))   Gauss linear;
    div(phi,C)        Gauss linear;
    div(phi,CbyC0)     Gauss linear;
} 

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
