cases/Biofilm_growth/multi_pores/c/cyclic-c-8e-5/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*defaultFieldValues
(
 volScalarFieldValue eps 1
volScalarFieldValue Ws 0
    
);
*/
regions
(
    boxToCell
    {
        box (0.003 0.005 0) (0.0031 0.0051 0.000001);
        //box (0.002 0.004 0) (0.028 0.006 0.0001);
        fieldValues
        (
           // volScalarFieldValue eps 1
            //volScalarFieldValue Ws 0.9
            //volScalarFieldValue Wf 0.27
           // volScalarFieldValue Weqbeta 0.27
             volScalarFieldValue MbbyMmax 0.9
        );
    }

    

);


// ************************************************************************* //
